{
  "Abby Luten": "The principal of Tina Koya High School. John hasn't met with her very often. An older woman who has dedicated a lot to her career, she spends much of her time worrying over running the school. She seems stressed due to something.",
  "Alex Hawkins": "The P.E. and health teacher at Tina Koya High School, the guidance counselor, and also the athletics coach. She attended Tina Koya herself several years ago and was an excellent student, inspiring her brother, Claus, to try to follow in her footsteps. Though rare in women, she seems to have some form of colorblindness.",
  "Allison Stein": "Part of the popular clique and Irene's childhood friend, sometimes known as {q}Alice.{/q} Allison seems to be a very polite and kind individual, which contrasts a bit with her friends. She is more than a little airheaded, and her gullibility is a cause of concern for Irene.",
  "Anuja Killada": "A foreign exchange student from India currently being hosted by Michelle's family. She's a very polite and soft-spoken person, and is still adapting to the environment. Though she usually avoids talking about it, she seems to have some problems with her mother back home.",
  "Audrey Callahan": "A first-year at the university, with an undecided major. Though she's not old enough to drink, she sometimes uses her social skills to get some booze.",
  "Brad Chambers": "One of the most popular guys at Tina Koya High, and one of the school's top athletes. He's a gregarious and easygoing student, but a tumultuous home life has made him overprotective of his sister Zoey. Brad is best friends with Eric, and doesn't like Kiyoshi due to his sister's strange attachment to him.",
  "Carrie Parker": "John's next-door neighbor. Her parents have chosen to homeschool her, so she doesn't go to class with the others. She doesn't get to interact very much with others her age, so she's taken a very particular interest in John. She tries to meet him in front of his house every morning before he goes to school, to mixed success.",
  "Cassie Wright": "A student at the local college and a friend of John's sister, Holly. Though she has been over a few times, John has interacted with her very little. Somewhat snobbish due to her social status, she always has a maid, Elizabeth, with her wherever she goes.",
  "Charlotte Foster": "A fashion design major at the local college. Charlotte is typically somewhat scatterbrained, kept in check by her best friend, Naomi. She has a tendency to embarrass herself in public, which sometimes deters her from pursuing anyone romantically. Despite sharing a major with fellow student Cassandra, she's often jealous of all the outfits she can afford.",
  "Circe": "A demon summoned by John during a magic ritual. She boasts having great power and pretty much any wish you can think of may be granted by her-- for a price. She's granted enough wishes over her long life that she gets amusement in twisting the thoughtless or altruistic wishes of new and unprepared summoners.",
  "Claus Hawkins": "The vice president of the Student Council who, like Yui, is a well-known stickler for school rules. He greatly admires his sister, Alex, and has taken up many of the duties she once held while she was a student. He's often seen discussing council business with Yui, or keeping watch over the newspaper club as the editor.",
  "Connie Williams": "A math teacher at Tina Koya who also oversees John's homeroom. A very kind woman, she tries hard to gain the favor of her students. Unfortunately she has a peculiar sense of humor, often telling lame jokes and puns which only Kiyoshi seems to appreciate.",
  "Cornelia Roberts": "Part of Sayaka's friend group. She's somewhat clingy and desperate for approval, causing her to always hang by Sayaka's side parroting her every opinion. Her small stature is a sensitive subject for her, but it also makes her an excellent flier on the cheerleading squad.",
  "Dominic Carter": "A college student working part-time at the mall's French restaurant, {i}Serenade,{/i} to make ends meet.",
  "Donna Barnes": "Secretary to the principal at Tina Koya High School. Besides filing and sorting paperwork, she also lets students who have been sent to the principal's office in to see Ms. Luten, and oversees classrooms in the event of a teacher's sudden absence. She has a bad habit of humming while she works, which drives Abby crazy.",
  "Elizabeth Sebas": "A loyal maid of the Wright family, and intimate confidant of the daughter, Cassandra. Her empathetic and virtuous character is only matched by her great sense of responsibility.",
  "Emily Brooks": "A student at Tina Koya High. She's known for her spontaneous nature and is always jumping at the chance to try something new. Her hobbies include cosplay and playing D&D with her friends, Kat, Michelle, and Anuja.",
  "Eric Tyner": "A slacker student, and Brad's best friend. He's a smoker, and often has to endure the wrath of Yui or Claus whenever he gets caught trying to sneak in a smoke break at school. He's also in a relationship with Maria, who often drags him off to more secluded locations.",
  "Faith Reinhardt": "A spooky ghost who haunts the girl's locker room. The circumstances in how she came to haunt the school are unknown, though there are many rumors. Most say she doesn't exist, but of course Kiyoshi is willing to investigate just about anything, especially if it involves the girl's locker room. Somehow, she looks familiar...",
  "Flavia Lucca": "An athletic, kindhearted, and beautiful girl at Tina Koya High School. She's the captain of the swim team and has been leading them to victory in many competitions lately. In addition, she's a member of the Student Council. Despite her popularity and the pedestal people put her on, she surprisingly doesn't have a boyfriend.",
  "Gabriel Riel": "A mysterious student. He seems to have an interest in the occult and pseudo-scientific subjects. Doesn't have many friends due to his often-condescending attitude.",
  "Genny Collins": "A student at Tina Koya High School, and childhood friend of Riley. She's studious, phlegmatic, and even-tempered, but enjoys teasing her easily-flustered friend. Her full first name is {q}Genevieve,{/q} but she doesn't seem to like it much and insists on {q}Genny.{/q}",
  "Grace Reinhardt": "The school's resident nurse. She's a slightly apathetic and pessimistic woman who doesn't hold back when talking to students. It's a well-known secret throughout the school that she has a drinking problem, and that she even has a stash hidden somewhere in her office.",
  "Greg Fisk": "A biology teacher at Tina Koya High School. Though fairly stern at times, he enjoys teaching his students and enthusiastically rewards hard work. Despite his chosen career, he's actually pretty squeamish about dissections.",
  "Gwen Strauss": "A clerk at one of the mall's many clothing stores. She has a keen eye for women's fashion, and a keener eye for women in general. Despite this, as a retail worker she puts up with a lot of abuse from picky, snobbish, or rude customers.",
  "Hank": "A burly auto mechanic with his own shop. He enjoys gardening in his spare time. A widower for some time now, he's recently re-entered the dating scene in search of a new wife.",
  "Hestia Virelles": "Irene's younger sister, and a friend of Natsumi and Jess. She's a quiet child and is often off in her own little world, but when she does speak she has a habit of being blunt or condescending. She enjoys playing with her house's fireplace.",
  "Holly Davis": "John's older sister, and a student at the local college. She used to be outgoing and have a wonderful relationship with her brother, but a couple of years ago she suddenly became very sullen and withdrawn, especially around John. John often wishes he could restore his relationship with her back to how it used to be.",
  "Irene Virelles": "Part of Sayaka's group, and a member of the school's volleyball team. She's protective of Allison, and doesn't seem to like the way the other popular girls influence or take advantage of her. This causes some friction between her and Sayaka.",
  "Izuna Ito": "A student with sharp senses and a sharper blade. Her nigh-superhuman athletic prowess is known to impress, as well. She usually speaks in a serious and disciplined manner, but is known to crack a joke on rare occasion. Despite sharing a mutual friend in Setsuna, John and Izuna seldom cross paths.",
  "Jack Mallory": "An abrasive history teacher at Tina Koya High School. He seems to deeply enjoy lecturing about bloody revolutions, the inquisition, and other violent events, particularly if they involve torture devices. Though he is well-known for being a jerk to his students, he seems especially fond of targeting John specifically.",
  "Jess Morgan": "The youngest child of the Morgan household. A bright young girl who's almost as energetic as her sister, Kat. She's best friends with Natsumi and Hestia.",
  "John Davis": "John is the main character of this story. An all-around average guy, though he has a few surprises hidden up his sleeve. He would rather spend most of his time playing video games instead of studying. Surprisingly good at speaking different languages and making new friends.",
  "Katrina Morgan": "One of John's close friends since the beginning of high school. Although she was without friends at the time, she now regularly hangs out with John's circle as well as her D&D group. She's very fun-loving and likes to joke around, but sometimes her jokes go a little too far. She seems to really dislike Sayaka for some reason.",
  "Kiyoshi Honda": "One of John's closest friends. He's a huge conspiracy nut and comes up with many insane theories. He also believes himself to be a ladies' man, and continually attempts to hit on most pretty girls he sees. Despite the trouble he causes, he's been a fast and true friend of John's social circle since middle school.",
  "Kyoko Hano": "John's childhood friend. The two of them are still very close. She shares many interests with Kiyoshi, and is the one who introduced him to John. Recently she seems to be having problems with some of the other girls at school.",
  "Laura Morgan": "Katrina's mother. She's an office worker for a large company, which keeps her busy for most of the day. Loves her children dearly, and wishes she had more time for them.",
  "Leona Winters": "An English teacher at school who is also John's neighbor. She's been friends with Sandra and Yuuna for a long time. She lives alone, and has been trying to change that fact without much success.",
  "Maria Grandales": "A member of the newspaper club who always carries her camera around with her. She's the biggest gossip in the school, and this reflects in the articles and photos she publishes in the paper. It's a good bet that if she finds out a big secret, the whole school will know soon after. She's also very open about her sex life, and often sneaks away her boyfriend Eric for some private time.",
  "Marty": "A bartender at the local pub. He's affable enough, and his wry smirk makes him pretty popular with the female clientele.",
  "Matt": "A manager of a company that establishes digital storefronts for small businesses, and a friend of Hank's from high school. He's also an avid collector of retro video games. Lately he's been seeking a woman to settle down with.",
  "Maurice Honda": "Kiyoshi's uncle who took him in after his parents died. He works as a detective, and is often away because of work, leaving Kiyoshi alone at home most of the time. He greatly enjoyed detective stories in his youth, which is why he became one. He loves telling stories about his own adventures, but often repeats the same ones over and over.",
  "Melanie {q}Mel{/q} Larner": "A member of the school's swim team alongside Flavia. She's very energetic and uses that energy as part of the swim team. Besides Flavia, she's also close friends with Zoey and the Hubbard twins. She grew up in a rural part of Osaklahoma, and speaks with somewhat of a southern drawl.",
  "Michelle Bloom": "One of the members of the school's newspaper club. Her family also acts as the host family for Anuja. She's a bright student, though a bit sneaky and conniving at times. She and Anuja host a D&D group at her house that Katrina, Emily, and sometimes John attend.",
  "Mina Hubbard": "The near-identical twin sister of Phila. Compared to her sister, Mina is very shy and meek, but is skilled at cooking. She only seems to talk to those whom she's come to trust, such as Zoey and Mel. She's always seen with her sister and seems to depend heavily on her to get through the day.",
  "Naomi Nakano": "The outgoing best friend of Charlotte. In some ways, she acts as a guardian for her friend, trying her best to keep Charlotte out of trouble. Despite her usual fun-loving and teasing exterior, she'd really like for Charlotte and herself to find nice guys to settle down with at some point.",
  "Natsumi Yamashita": "Yuuna's daughter and Yui's little sister. Sandra often has to babysit her due to Yuuna's work schedule and Yui's Student Council commitments. She's a good kid, but finds her sister's obsession with rules and order annoying. Wants to be grown up so she can do things like play video games that she's not allowed to play. Disturbingly skilled at Monopoly.",
  "Nemuri Otani": "A friend of Sandra's from some time ago. He runs the local shrine, taking care of both the shrine and his sickly daughter, Setsuna. He's a very thoughtful individual who often worries for his daughter. He tries to homeschool Setsuna, though he admits he can't replace actually going to school.",
  "Nora Whittaker": "A younger teacher at one of San Fransokyo's elementary schools. Her patient demeanor and warm, maternal personality make her well-liked by the student body.",
  "Patty": "A shady young woman operating a fortune-telling stall outside the mall. It's not clear how much of her business is legitimately connected to the supernatural and how much is just good old-fashioned grifting, but it's definitely somewhere between the two.",
  "Paul Simmons": "A friendly face who is a major in accounting and a major nerd. While most people won't get his references, they still regard him as a pretty likable guy. In his free time, he also likes to exercise, but is often overshadowed by the nerdy vibe he puts out.",
  "Phila Hubbard": "The near-identical twin sister of Mina. Compared to her sister, she's a lot more stern and irritable, and is often seen by others as bossy. She's very protective of her sister and the two are never seen apart when they can help it, which some people think is a little odd. She enjoys playing video games while Mina watches.",
  "Rachel Clark": "A physics teacher at Tina Koya High School. She has a reputation as one of the cooler teachers, but also one of the scarier ones when annoyed. She believes in discipline and can often be seen trying to whip Tori and Vanessa into shape.",
  "Riley Evans": "A student at Tina Koya High School, often seen together with his childhood friend Genny. He's smaller and more delicate than most of his male peers, making him somewhat insecure. Though too timid to approach them, he's easily enamored with cute girls and quick to embarrass as a consequence.",
  "Rita Piper": "A member of Sayaka's friend group from a wealthy background. She's mercurial and brutish, with some odd hobbies unbecoming of her looks or status. Tends to speak her mind fairly freely, and enjoys poking at other people with blunt or crass remarks. She holds a long-standing grudge with Tori, both in and out of the boxing ring.",
  "Sadie-Lynn Kobayashi": "A student who transferred to Tina Koya during the middle of the previous year. She was part of the cheer team at her previous school, and joined Tina Koya's team immediately after transferring. Due to her cute looks and position on the cheer team, she quickly became part of the school's popular clique.",
  "Sandra Davis": "John's mother who also works as a language teacher at his school alongside her long-time friend Leona. She's raised Holly and John by herself for years now, as well as done a lot of babysitting Yuuna's children as they grew up. Sandra is a very fun-loving person and likes to tease John, taking a particular interest in her son's love life.",
  "Sayaka Sato": "The most popular girl in school, the captain of the cheerleading team, and the overall queen bee of Tina Koya. Her outward glamour doesn't extend past the sweet face she shows most people. Looks down on others such as John's friends, and seems to have a particularly strong dislike of Katrina.",
  "Scarlet Morgan": "The eldest child of the Morgan household. She's a college student, so she's often busy with her school work. Without coffee she's all but non-functional in the mornings.",
  "Setsuna Otani": "One of John's early childhood friends, due to their parents being old friends themselves. Her father runs the local shrine, which she helps to maintain. Due to sickness, she has been unable to attend school with the others, leaving her feeling lonely. It's because of this that John often takes the time to meet with her at the shrine.",
  "Vanessa Russell": "A troublesome student at Tina Koya High School. She looks up to Tori and tries to emulate her delinquent behavior, to mixed results. She struggles academically, having trouble with math in particular.",
  "Victoria {q}Tori{/q} Vega": "The number one delinquent of the school. She's irritable and often picks fights with others such as Rita or Yui. She's best friends with her fellow delinquent Vanessa, and has a complicated relationship with Ms. Clark.",
  "Yui Yamashita": "President of the Student Council. She takes her position very seriously and is very strict in following the rules and policing others to do the same. She and John were actually childhood friends due to their mothers' friendship, but drifted apart in teenhood.",
  "Yuuna Yamashita": "A close friend of Sandra and Leona from college, and the mother of Yui and Natsumi. As a single mother she's been preoccupied with keeping her family's livelihood stable, leaving her little time to watch her children or to go out drinking with Sandra and Leona like she used to.",
  "Zoey Chambers": "A student at Tina Koya High, and Brad's little sister. Though she usually does not interact with John's group very much, she has an obviously one-sided crush on Kiyoshi. She's very active and energetic, and shares an interest in physical activities with her brother."
}
